{
    "project__data": [
        {
            "name": "OffQuiz",
            "bullets": [
                {
                    "bullet": "Teacher can use the web portal to form batches of students."
                },
                {
                    "bullet": "Quiz can be created on the web portal by the teacher."
                },
                {
                    "bullet": "All the created quizzes can be viewed on the dashboard."
                },
                {
                    "bullet": "Once the quiz is created the teacher can circulate the quiz within an already created batch of students."
                },
                {
                    "bullet": "At the students end, all you require is a smartphone with incoming sms facility."
                },
                {
                    "bullet": "Students receive a encrypted message on their phone which the OffQuiz App decrypts and display the Quiz on screen."
                },
                {
                    "bullet": "INTERNET CONNECTION IS NOT REQUIRED AT THE STUDENTS' END TO ATTEMPT THE QUIZ."
                },
                {
                    "bullet": "The Quiz Responses are encrypted and sent to our servers through sms."
                },
                {
                    "bullet": "Teacher can view the responses of all the student on our web application."
                }
            ],
            "image": "images/landing.png",
            "github__link": "https://github.com/ultra-noobs/OffQuiz",
            "star__link": "https://github.com/ultra-noobs/OffQuiz",
            "link": "https://offquiz-app.netlify.app/",
            "stack": [
                "express.js",
                "node.js",
                "firebase",
                "flutter",
                "React.js",
                "Sass"
            ]
        },
        {
            "name": "Ideaster",
            "bullets": [
                {
                    "bullet": "A decentralized platform made with React js and boostrapped with Semantic-ui-react"
                },
                {
                    "bullet": "User can deploy his ideas to provoke his ownership over the posted ideas"
                },
                {
                    "bullet": "Serves the purpose of testing and reviewing ideas in a anonymous way."
                },
                {
                    "bullet": "User with necessary interest can provide his reviews over idea."
                },
                {
                    "bullet": "Contructive reviews reviewers get rewarded in eth tokens."
                },
                {
                    "bullet": "Smart contract deployed over rinkeby test network and used firebase as supportive DB."
                }
            ],
            "image": "images/ideaster.png",
            "github__link": "https://github.com/nlok5923/Ideaster-BC",
            "star__link": "https://github.com/nlok5923/Ideaster-BC",
            "link": "test",
            "stack": [
                "React js",
                "Solidity",
                "Scss",
                "firebase"
            ]
        },
        {
            "name": "Sahaayak",
            "bullets": [
                {
                    "bullet": "Sahaayak is an online platform which is enabled with certain features and valuable propects to improvise the traditional as well as virtual learning mode of education."
                },
                {
                    "bullet": "This platform performs certain tasks, Some of them are listed below: An Institute can setup an admin to take overall power to maintain a web system."
                },
                {
                    "bullet": "An Instructor can register himself via admin assist and will be mailed with proper credentials once registered."
                },
                {
                    "bullet": "Instructor can add lectures included with videos ,3D models, images or any element or resource which can be used for Rich text formatting can be used by instructor."
                },
                {
                    "bullet": "An whole page is dedicated for creation and management of lecture by Instructor. "
                },
                {
                    "bullet": "Students can access all lectures at once, separated subject wise in order to provide convenience and decrease time wastage in finding lectures or resources sent by Instructor."
                },
                {
                    "bullet": " An whole page is dedicated to each lecture made by instructor."
                },
                {
                    "bullet": "3D platform integrated with every lecture to understand concepts via 3d models. "
                },
                {
                    "bullet": "Students can ask doubt in every lecture through Doubt button included in every lecture, His doubt will the mailed to faculty responsible for creating that particular lecture on which doubt raised along with that lecture."
                }
            ],
            "image": "images/sahhaayak.png",
            "github__link": "https://github.com/Sahaayak",
            "star__link": "https://github.com/Sahaayak",
            "link": "https://sahaaayak.herokuapp.com/",
            "stack": [
                "express.js",
                "node.js",
                "Three.js",
                "echoar",
                "html/css3",
                "ejs",
                "mongodb",
                "mongoose"
            ]
        },
        {
            "name": "Attender",
            "bullets": [
                {
                    "bullet": "The aim of this platform is to track whether a student is actually attending classes or just joined."
                },
                {
                    "bullet": "In this platform, the instructor can create a lecture and after creating the lecture we will provide a unique id to the instructor which he needs to circulate among his students."
                },
                {
                    "bullet": "As a student, you need to register yourself on this platform and upload your image for detection purposes. "
                },
                {
                    "bullet": " After registering you need to log in yourself after login you can enter the id which is provided by the course instructor of the current lecture"
                },
                {
                    "bullet": "then click on the start button and now you are all done. "
                },
                {
                    "bullet": "Now students attend classes as they normally attend but they need to open our web in another tab so that we can track them. "
                },
                {
                    "bullet": "And all this attendance information will be available for the instructor responsible for that particular lecture after the lecture ends."
                }
            ],
            "image": "images/test.png",
            "github__link": "https://github.com/nlo5923/Attenders",
            "star__link": "https://github.com/nlok5923/Attenders",
            "link": "http://attender01.herokuapp.com/",
            "stack": [
                "express.js",
                "node.js",
                "face-api.js",
                "ejs",
                "html/css3",
                "firebase",
                "mongodb",
                "mongoose"
            ]
        },
        {
            "name": "Musical IDE",
            "bullets": [
                {
                    "bullet": "This is the unique online IDE (intergrated development enviroment) integrated with music players."
                },
                {
                    "bullet": "It offers support for compilation and run time execution of several languages such as C++, python, Java, C code."
                },
                {
                    "bullet": "This IDE is integrated with a music player which enables your to hear your favourite songs at the moment you were coding."
                }
            ],
            "image": "images/ide.png",
            "github__link": "https://github.com/nlok5923/musical-ide",
            "star__link": "https://github.com/nlok5923/musical-ide",
            "link": "https://musical-ide.netlify.app/",
            "stack": [
                "Reactjs",
                "Sass",
                "Judge0 api",
                "Monaco"
            ]
        }
    ]
}